app/controllers/api/folders_controller.rb

        def create
            render json: { message: "name cant be blank" }, status: 401 if folder_params[:name].blank? and return
            if folder_params[:parent_id].present?
                parent_folder = Folder.find_by(id: folder_params[:parent_id])
                render json: { message: "parent folder not found" }, status: 401 if !parent_folder.present? and return
                new_folder = parent_folder.children.create(name: folder_params[:name])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "folders" ("parent_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["parent_id", 2], ["name", "teste2"], ["created_at", "2021-04-27 21:10:34.424367"], ["updated_at", "2021-04-27 21:10:34.424367"]]